HUST-AI-HYZ/17th-National-College-SmartCar-Outdoor-Group-HUST/Codes/National Competition(Brush Less motor)/bldc controller/8.21 SPIN360C Open-loop/libraries/sdk/MM32SPIN2xx_p_LIB/Include/MM32SPIN2xx_p.h
/********************  Bit definition for ADDATA register  ********************/
#define  ADDATA_DATA                         ((uint32_t)0x00000FFF)               /*!<ADC 12bit convert data */
#define  ADDATA_CHANNELSEL                   ((uint32_t)0x00070000)               /*!<CHANNELSEL[19:16] (ADC current channel convert data) */
#define  ADDATA_CHANNELSEL_0                 ((uint32_t)0x00010000)               /*!<Bit 0 */
#define  ADDATA_CHANNELSEL_1                 ((uint32_t)0x00020000)               /*!<Bit 1*/
#define  ADDATA_CHANNELSEL_2                 ((uint32_t)0x00040000)               /*!<Bit 2 */
#define  ADDATA_CHANNELSEL_3                 ((uint32_t)0x00080000)               /*!<Bit 3 */
#define  ADDATA_OVERRUN                      ((uint32_t)0x00100000)               /*!<ADC data will be cover */
#define  ADDATA_VALID                        ((uint32_t)0x00200000)               /*!<ADC data[11:0] is valid*/


/********************  Bit definition for ADCFG register  ********************/
#define  ADCFG_ADEN                           ((uint32_t)0x00000001)               /*!<ADC convert enable */
#define  ADCFG_ADWEN                          ((uint32_t)0x00000002)               /*!<ADC window compare enable */
#define  ADCFG_TSEN                           ((uint32_t)0x00000004)               /*!<ADC sensor enable */
#define  ADCFG_VSEN                           ((uint32_t)0x00000008)               /*!<ADC sensor enable */

#define  ADCFG_ADCPRE                         ((uint32_t)0x00004070)               /*!<ADC preclk  */
#define  ADCFG_ADCPRE_2                       ((uint32_t)0x00000000)               /*!<ADC preclk 2 */
#define  ADCFG_ADCPRE_4                       ((uint32_t)0x00000010)               /*!<ADC preclk 4 */
#define  ADCFG_ADCPRE_6                       ((uint32_t)0x00000020)               /*!<ADC preclk 6 */
#define  ADCFG_ADCPRE_8                       ((uint32_t)0x00000030)               /*!<ADC preclk 8 */
#define  ADCFG_ADCPRE_10                      ((uint32_t)0x00000040)               /*!<ADC preclk 10 */
#define  ADCFG_ADCPRE_12                      ((uint32_t)0x00000050)               /*!<ADC preclk 12 */
#define  ADCFG_ADCPRE_14                      ((uint32_t)0x00000060)               /*!<ADC preclk 14 */
#define  ADCFG_ADCPRE_16                      ((uint32_t)0x00000070)               /*!<ADC preclk 16 */
#define  ADCFG_ADCPRE_3                       ((uint32_t)0x00004000)               /*!<ADC preclk 3 */
#define  ADCFG_ADCPRE_5                       ((uint32_t)0x00004010)               /*!<ADC preclk 5 */
#define  ADCFG_ADCPRE_7                       ((uint32_t)0x00004020)               /*!<ADC preclk 7 */
#define  ADCFG_ADCPRE_9                       ((uint32_t)0x00004030)               /*!<ADC preclk 9 */
#define  ADCFG_ADCPRE_11                      ((uint32_t)0x00004040)               /*!<ADC preclk 11 */
#define  ADCFG_ADCPRE_13                      ((uint32_t)0x00004050)               /*!<ADC preclk 13 */
#define  ADCFG_ADCPRE_15                      ((uint32_t)0x00004060)               /*!<ADC preclk 15 */
#define  ADCFG_ADCPRE_17                      ((uint32_t)0x00004070)               /*!<ADC preclk 17 */

#define  ADCFG_RSLTCTL                        ((uint32_t)0x00000380)
#define  ADCFG_RSLTCTL_0                      ((uint32_t)0x00000080)
#define  ADCFG_RSLTCTL_1                      ((uint32_t)0x00000100)
#define  ADCFG_RSLTCTL_2                      ((uint32_t)0x00000200)

#define  ADCFG_SAMCTL                         ((uint32_t)0x00003C00)
#define  ADCFG_SAMCTL_0                       ((uint32_t)0x00000400)
#define  ADCFG_SAMCTL_1                       ((uint32_t)0x00000800)
#define  ADCFG_SAMCTL_2                       ((uint32_t)0x00001000)
#define  ADCFG_SAMCTL_3                       ((uint32_t)0x00002000)

/********************  Bit definition for ADCR register  ********************/
#define  ADCR_ADIE                            ((uint32_t)0x00000001)               /*!<ADC interrupt enable */
#define  ADCR_ADWIE                           ((uint32_t)0x00000002)               /*!<ADC window compare interrupt enable */
#define  ADCR_TRGEN                           ((uint32_t)0x00000004)               /*!<extranal trigger single start AD convert */
#define  ADCR_DMAEN                           ((uint32_t)0x00000008)               /*!<ADC DMA enable */

#define  ADCR_TRGSEL                          ((uint32_t)0x00060070)               /*!<TRGSEL[6:4][18:17] ADC1 external trigger source select */
#define  ADCR_TRGSEL_0                        ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADCR_TRGSEL_1                        ((uint32_t)0x00000020)               /*!<Bit 1 */
#define  ADCR_TRGSEL_2                        ((uint32_t)0x00000040)               /*!<Bit 2 */
#define  ADCR_TRGSEL_3                        ((uint32_t)0x00020000)               /*!<Bit 3 */
#define  ADCR_TRGSEL_4                        ((uint32_t)0x00040000)               /*!<Bit 4 */

#define  ADCR_ADST                            ((uint32_t)0x00000100)               /*!<ADC start convert data */
#define  ADCR_ADMD_SINGLE                     ((uint32_t)0x00000000)               /*!<ADC single convert mode */
#define  ADCR_ADMD_PERIOD                     ((uint32_t)0x00000200)               /*!<ADC single period convert mode */
#define  ADCR_ADMD_CONTINUE                   ((uint32_t)0x00000400)               /*!<ADC continue scan convert mode */
#define  ADCR_ALIGN_LEFT                      ((uint32_t)0x00000800)               /*!<ADC data left align */
#define  ADCR_ALIGN_RIGHT                     ((uint32_t)0x00000000)               /*!<ADC data right align */

#define  ADCR_CMPCH                           ((uint32_t)0x0000F000)               /*!<CMPCH[15:12] ADC window compare channel0 convert data */
#define  ADCR_CMPCH_0                         ((uint32_t)0x00001000)               /*!<Bit 0 */
#define  ADCR_CMPCH_1                         ((uint32_t)0x00002000)               /*!<Bit 1 */
#define  ADCR_CMPCH_2                         ((uint32_t)0x00004000)               /*!<Bit 2 */
#define  ADCR_CMPCH_3                         ((uint32_t)0x00008000)               /*!<Bit 3 */

#define  ADCR_SCANDIR                         ((uint32_t)0x00010000)               /*!<ADC scan direction */
#define  ADCR_TRGSHIFT                        ((uint32_t)0x00380000)               /*!<External trigger shift sample */
#define  ADCR_TRGSHIFT_0                      ((uint32_t)0x00000000)               /*!<No shift */
#define  ADCR_TRGSHIFT_4                      ((uint32_t)0x00080000)               /*!<Shift 4 period */
#define  ADCR_TRGSHIFT_16                     ((uint32_t)0x00100000)               /*!<Shift 16 period */
#define  ADCR_TRGSHIFT_32                     ((uint32_t)0x00180000)               /*!<Shift 32 period */
#define  ADCR_TRGSHIFT_64                     ((uint32_t)0x00200000)               /*!<Shift 64 period */
#define  ADCR_TRGSHIFT_128                    ((uint32_t)0x00280000)               /*!<Shift 128 period */
#define  ADCR_TRGSHIFT_256                    ((uint32_t)0x00300000)               /*!<Shift 256 period */
#define  ADCR_TRGSHIFT_512                    ((uint32_t)0x00380000)               /*!<Shift 512 period */

#define  ADCR_CALIBEN                         ((uint32_t)0x00400000)               /*!<Self-calibration enable */
#define  ADCR_CALIBSEL                        ((uint32_t)0x00800000)               /*!<Self-calibration voltage selection */

/********************  Bit definition for ADCHS register  ********************/
#define  ADCHS_CHEN0                          ((uint32_t)0x00000001)              /*!<ADC channel0 enable */
#define  ADCHS_CHEN1                          ((uint32_t)0x00000002)              /*!<ADC channel1 enable */
#define  ADCHS_CHEN2                          ((uint32_t)0x00000004)              /*!<ADC channel2 enable */
#define  ADCHS_CHEN3                          ((uint32_t)0x00000008)              /*!<ADC channel3 enable */
#define  ADCHS_CHEN4                          ((uint32_t)0x00000010)              /*!<ADC channel4 enable */
#define  ADCHS_CHEN5                          ((uint32_t)0x00000020)              /*!<ADC channel5 enable */
#define  ADCHS_CHEN6                          ((uint32_t)0x00000040)              /*!<ADC channel6 enable */
#define  ADCHS_CHEN7                          ((uint32_t)0x00000080)              /*!<ADC channel7 enable */
#define  ADCHS_CHEN8                          ((uint32_t)0x00000100)              /*!<ADC channel8 enable */
#define  ADCHS_CHEN9                          ((uint32_t)0x00000200)              /*!<ADC channel9 enable */
#define  ADCHS_CHEN10                         ((uint32_t)0x00000400)              /*!<ADC channel10 enable */
#define  ADCHS_CHEN11                         ((uint32_t)0x00000800)              /*!<ADC channel11 enable */
#define  ADCHS_CHCALIB                        ((uint32_t)0x00002000)              /*!<ADC internal self-calibration channel enable */
#define  ADCHS_CHENTS                         ((uint32_t)0x00004000)              /*!<Temperature Sensor enable */
#define  ADCHS_CHENVS                         ((uint32_t)0x00008000)              /*!<Voltage Sensor enable */


/********************  Bit definition for ADCMPR register  ********************/
#define  ADCMPR_CMPLDATA                      ((uint32_t)0x00000FFF)              /*!<ADC 12bit window compare DOWN LEVEL DATA*/
#define  ADCMPR_CMPHDATA                      ((uint32_t)0x0FFF0000)              /*!<ADC 12bit window compare UP LEVEL DATA*/

/********************  Bit definition for ADSTA register  ********************/
#define  ADSTA_ADIF                           ((uint32_t)0x00000001)               /*!<ADC convert complete flag*/
#define  ADSTA_ADWIF                          ((uint32_t)0x00000002)               /*!<ADC compare flag*/
#define  ADSTA_BUSY                           ((uint32_t)0x00000004)               /*!<ADC busy flag*/
#define  ADSTA_CHANNEL                        ((uint32_t)0x000001F0)               /*!<CHANNEL[8:4] ADC current channel*/
#define  ADSTA_CHANNEL_0                      ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADSTA_CHANNEL_1                      ((uint32_t)0x00000020)               /*!<Bit 1*/
#define  ADSTA_CHANNEL_2                      ((uint32_t)0x00000040)               /*!<Bit 2*/
#define  ADSTA_CHANNEL_3                      ((uint32_t)0x00000080)               /*!<Bit 3*/
#define  ADSTA_CHANNEL_4                      ((uint32_t)0x00000100)               /*!<Bit 4*/

#define  ADSTA_VALID                          ((uint32_t)0x000FFF00)               /*!<VALID[19:8] ADC channel0 valid flag*/
#define  ADSTA_VALID_0                        ((uint32_t)0x00000100)               /*!<Bit 0*/
#define  ADSTA_VALID_1                        ((uint32_t)0x00000200)               /*!<Bit 1*/
#define  ADSTA_VALID_2                        ((uint32_t)0x00000400)               /*!<Bit 2*/
#define  ADSTA_VALID_3                        ((uint32_t)0x00000800)               /*!<Bit 3*/
#define  ADSTA_VALID_4                        ((uint32_t)0x00001000)               /*!<Bit 4*/
#define  ADSTA_VALID_5                        ((uint32_t)0x00002000)               /*!<Bit 5*/
#define  ADSTA_VALID_6                        ((uint32_t)0x00004000)               /*!<Bit 6*/
#define  ADSTA_VALID_7                        ((uint32_t)0x00008000)               /*!<Bit 7*/
#define  ADSTA_VALID_8                        ((uint32_t)0x00010000)               /*!<Bit 8*/
#define  ADSTA_VALID_9                        ((uint32_t)0x00020000)               /*!<Bit 9*/
#define  ADSTA_VALID_10                       ((uint32_t)0x00040000)               /*!<Bit 10*/
#define  ADSTA_VALID_11                       ((uint32_t)0x00080000)               /*!<Bit 11*/

#define  ADSTA_OVERRUN                        ((uint32_t)0xFFF00000)               /*!<OVERRUN[31:20] ADC channel0 data covered flag*/
#define  ADSTA_OVERRUN_0                      ((uint32_t)0x00100000)               /*!<Bit 0*/
#define  ADSTA_OVERRUN_1                      ((uint32_t)0x00200000)               /*!<Bit 1*/
#define  ADSTA_OVERRUN_2                      ((uint32_t)0x00400000)               /*!<Bit 2*/
#define  ADSTA_OVERRUN_3                      ((uint32_t)0x00800000)               /*!<Bit 3*/
#define  ADSTA_OVERRUN_4                      ((uint32_t)0x01000000)               /*!<Bit 4*/
#define  ADSTA_OVERRUN_5                      ((uint32_t)0x02000000)               /*!<Bit 5*/
#define  ADSTA_OVERRUN_6                      ((uint32_t)0x04000000)               /*!<Bit 6*/
#define  ADSTA_OVERRUN_7                      ((uint32_t)0x08000000)               /*!<Bit 7*/
#define  ADSTA_OVERRUN_8                      ((uint32_t)0x10000000)               /*!<Bit 8*/
#define  ADSTA_OVERRUN_9                      ((uint32_t)0x20000000)               /*!<Bit 9*/
#define  ADSTA_OVERRUN_10                     ((uint32_t)0x40000000)               /*!<Bit 10*/
#define  ADSTA_OVERRUN_11                     ((uint32_t)0x80000000)               /*!<Bit 11*/

/********************  Bit definition for ADDR0~ADDR15 register  ********************/
#define  ADDR_DATA                            ((uint32_t)0x00000FFF)               /*!<ADC channel convert data */
#define  ADDR_OVERRUN                         ((uint32_t)0x00100000)               /*!<ADC data covered flag */
#define  ADDR_VALID                           ((uint32_t)0x00200000)               /*!<ADC data valid flag*/

/********************  Bit definition for ADSTA_EXT register  ********************/
#define  ADSTA_EXT_VALID                      ((uint32_t)0x0000000F)               /*!<Valid flag */
// #define  ADSTA_EXT_VALID_0                    ((uint32_t)0x00000001)               /*!<Bit 0 */
#define  ADSTA_EXT_VALID_1                    ((uint32_t)0x00000002)               /*!<Bit 1 */
#define  ADSTA_EXT_VALID_2                    ((uint32_t)0x00000004)               /*!<Bit 2 */
#define  ADSTA_EXT_VALID_3                    ((uint32_t)0x00000008)               /*!<Bit 3 */
#define  ADSTA_EXT_OVERRUN                    ((uint32_t)0x000000F0)               /*!<Overrun flag */
// #define  ADSTA_EXT_OVERRUN_0                  ((uint32_t)0x00000010)               /*!<Bit 0 */
#define  ADSTA_EXT_OVERRUN_1                  ((uint32_t)0x00000020)               /*!<Bit 1 */
#define  ADSTA_EXT_OVERRUN_2                  ((uint32_t)0x00000040)               /*!<Bit 2 */
#define  ADSTA_EXT_OVERRUN_3                  ((uint32_t)0x00000080)               /*!<Bit 3 */


/******************************************************************************/
/*                                                                            */
/*                                   COMP                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for COMP_CSR register  *******************/
#define  COMP_CSR_EN                          ((uint32_t)0x00000001)
#define  COMP_CSR_MODE                        ((uint32_t)0x0000000C)
#define  COMP_CSR_MODE_0                      ((uint32_t)0x00000004)
#define  COMP_CSR_MODE_1                      ((uint32_t)0x00000008)

#define  COMP_CSR_OUT_SEL                     ((uint32_t)0x00003C00)
#define  COMP_CSR_OUT_SEL_0                   ((uint32_t)0x00000400)
#define  COMP_CSR_OUT_SEL_1                   ((uint32_t)0x00000800)
#define  COMP_CSR_OUT_SEL_2                   ((uint32_t)0x00001000)
#define  COMP_CSR_OUT_SEL_3                   ((uint32_t)0x00002000)

