HUST-AI-HYZ/17th-National-College-SmartCar-Outdoor-Group-HUST/Codes/National Competition(Brush Less motor)/bldc controller/8.21 SPIN360C Open-loop/libraries/sdk/MM32SPIN2xx_p_LIB/Include/MM32SPIN2xx_p.h
#define  TIM_CCMR3_OC5CE                     ((uint16_t)0x0080)            /*!<Output Compare 5 Clear Enable */


/******************************************************************************/
/*                                                                            */
/*                               PWM	                                 	  */
/*                                                                            */
/******************************************************************************/	//CD
/*******************  Bit definition for PWM_CSR register  ********************/
#define  PWM_CSR_CCE                       	((uint16_t)0x0001)            /*!<Current Compensation Enable */
#define  PWM_CSR_CPE                       	((uint16_t)0x0002)            /*!<Current Protection Enable */
#define  PWM_CSR_APMTIE                    	((uint16_t)0x0004)            /*!<Auto phase mask trigger interrupt enable */
#define  PWM_CSR_TERRIE                    	((uint16_t)0x0008)            /*!<Trigger error interrupt enable */

#define  PWM_CSR_CC_TRGSEL                 	((uint16_t)0x0030)            /*!<Current compensation trigger selection */
#define  PWM_CSR_CC_TRGSEL_0                ((uint16_t)0x0010)            /*!<Bit 0 */
#define  PWM_CSR_CC_TRGSEL_1                ((uint16_t)0x0020)            /*!<Bit 1 */

#define  PWM_CSR_CC_STRG                    ((uint16_t)0x0040)            /*!<Current compensation software trigger */

#define  PWM_CSR_CP_TRGSEL                  ((uint16_t)0x0380)            /*!<Current protection trigger selection */
#define  PWM_CSR_CP_TRGSEL_0                ((uint16_t)0x0080)            /*!<Bit 0 */
#define  PWM_CSR_CP_TRGSEL_1                ((uint16_t)0x0100)            /*!<Bit 1 */
#define  PWM_CSR_CP_TRGSEL_2                ((uint16_t)0x0200)            /*!<Bit 2 */

#define  PWM_CSR_CP_MDSEL                   ((uint16_t)0x0400)            /*!<Current protection mode selection */
#define  PWM_CSR_APMTIF                     ((uint16_t)0x0800)            /*!<Auto phase mask trigger flag */
#define  PWM_CSR_TERRIF                     ((uint16_t)0x1000)            /*!<Trigger error flag */

#define  PWM_CSR_IOFLT                      ((uint16_t)0xE000)            /*!<GPIO input filter */
#define  PWM_CSR_IOFLT_0                    ((uint16_t)0x2000)            /*!<Bit 0 */
#define  PWM_CSR_IOFLT_1                    ((uint16_t)0x4000)            /*!<Bit 1 */
#define  PWM_CSR_IOFLT_2                    ((uint16_t)0x8000)            /*!<Bit 2 */

#define  PWM_CSR_HALL_TRGSEL                ((uint32_t)0x00030000)        /*!<hall sensor trg select*/
#define  PWM_CSR_HALL_TRGSEL_0              ((uint32_t)0x00010000)        /*!<Bit 0*/
#define  PWM_CSR_HALL_TRGSEL_1              ((uint32_t)0x00020000)        /*!<Bit 1*/

#define  PWM_CSR_CURR_EN                    ((uint32_t)0x00040000)        /*!< */

#define  PWM_CSR_MSKDAT_CURR                ((uint32_t)0x01F80000)        /*!< */
#define  PWM_CSR_MSKDAT_CURR_0              ((uint32_t)0x000800000)       /*!<Bit 0 */
#define  PWM_CSR_MSKDAT_CURR_1              ((uint32_t)0x00100000)        /*!<Bit 1 */
#define  PWM_CSR_MSKDAT_CURR_2              ((uint32_t)0x00200000)        /*!<Bit 2 */
#define  PWM_CSR_MSKDAT_CURR_3              ((uint32_t)0x00400000)        /*!<Bit 3 */
#define  PWM_CSR_MSKDAT_CURR_4              ((uint32_t)0x00800000)        /*!<Bit 4 */
#define  PWM_CSR_MSKDAT_CURR_5              ((uint32_t)0x01000000)        /*!<Bit 5 */

#define  PWM_CSR_MSKEN_CURR                 ((uint32_t)0x7E000000)        /*!< */
#define  PWM_CSR_MSKEN_CURR_0               ((uint32_t)0x02000000)        /*!<Bit 0 */
#define  PWM_CSR_MSKEN_CURR_1               ((uint32_t)0x04000000)        /*!<Bit 1 */
#define  PWM_CSR_MSKEN_CURR_2               ((uint32_t)0x08000000)        /*!<Bit 2 */
#define  PWM_CSR_MSKEN_CURR_3               ((uint32_t)0x10000000)        /*!<Bit 3 */
#define  PWM_CSR_MSKEN_CURR_4               ((uint32_t)0x20000000)        /*!<Bit 4 */
#define  PWM_CSR_MSKEN_CURR_5               ((uint32_t)0x40000000)        /*!<Bit 5 */


/*******************  Bit definition for PWM_APMSKR register  *****************/
#define  PWM_APMSKR_MSKDAT                  ((uint16_t)0x003F)        	  /*!<PWM mask data */
#define  PWM_APMSKR_MSKDAT_0                ((uint16_t)0x0001)        	  /*!<Bit 0 */
#define  PWM_APMSKR_MSKDAT_1                ((uint16_t)0x0002)        	  /*!<Bit 1 */
#define  PWM_APMSKR_MSKDAT_2                ((uint16_t)0x0004)        	  /*!<Bit 2 */
#define  PWM_APMSKR_MSKDAT_3                ((uint16_t)0x0008)        	  /*!<Bit 3 */
#define  PWM_APMSKR_MSKDAT_4                ((uint16_t)0x0010)        	  /*!<Bit 4 */
#define  PWM_APMSKR_MSKDAT_5                ((uint16_t)0x0020)        	  /*!<Bit 5 */

#define  PWM_APMSKR_MSKEN                   ((uint16_t)0x3F00)        	  /*!<PWM mask function enable */
#define  PWM_APMSKR_MSKEN_0                 ((uint16_t)0x0100)        	  /*!<Bit 0 */
#define  PWM_APMSKR_MSKEN_1                 ((uint16_t)0x0200)        	  /*!<Bit 1 */
#define  PWM_APMSKR_MSKEN_2                 ((uint16_t)0x0400)        	  /*!<Bit 2 */
#define  PWM_APMSKR_MSKEN_3                 ((uint16_t)0x0800)        	  /*!<Bit 3 */
#define  PWM_APMSKR_MSKEN_4                 ((uint16_t)0x1000)        	  /*!<Bit 4 */
#define  PWM_APMSKR_MSKEN_5                 ((uint16_t)0x2000)        	  /*!<Bit 5 */

#define  PWM_APMSKR_APM_TRGSEL              ((uint32_t)0x00030000)        /*!<Auto phase mask trigger selection */
#define  PWM_APMSKR_APM_TRGSEL_0            ((uint32_t)0x00010000)        /*!<Bit 0 */
#define  PWM_APMSKR_APM_TRGSEL_1            ((uint32_t)0x00020000)        /*!<Bit 1 */

#define  PWM_APMSKR_APM_STRG                ((uint32_t)0x00040000)        /*!<Auto phase mask software trigger */

#define  PWM_APMSKR_ENTRGI                  ((uint32_t)0x00700000)        /*!<Expect next trigger input */
#define  PWM_APMSKR_ENTRGI_0                ((uint32_t)0x00100000)        /*!<Bit 0 */
#define  PWM_APMSKR_ENTRGI_1                ((uint32_t)0x00200000)        /*!<Bit 1 */
#define  PWM_APMSKR_ENTRGI_2                ((uint32_t)0x00400000)        /*!<Bit 2 */

#define  PWM_APMSKR_CTRGI                   ((uint32_t)0x03800000)        /*!<current trigger input */
#define  PWM_APMSKR_CTRGI_0                 ((uint32_t)0x00800000)        /*!<Bit 0*/
#define  PWM_APMSKR_CTRGI_1                 ((uint32_t)0x01000000)         /*!<Bit 1*/
#define  PWM_APMSKR_CTRGI_2                 ((uint32_t)0x02000000)         /*!<Bit 2*/

